In [ ]:
## Im modifying this code

In [14]:
#  create a sample data frame has missing values
import numpy as np
import pandas as pd


data={"Names":['Ram','Laxman',np.nan,'Sita'],
     "Ages":[np.nan,23,22,21],
     "City":["Hyd",'Blr','Pune',np.nan]}

df=pd.DataFrame(data)

In [3]:
df

    Names  Ages  City
0     Ram   NaN   Hyd
1  Laxman  23.0   Blr
2     NaN  22.0  Pune
3    Sita  21.0   NaN

In [4]:
df.shape

(4, 3)

In [5]:
df.isnull()

#NAN : Not a Number
#np.nan

   Names   Ages   City
0  False   True  False
1  False  False  False
2   True  False  False
3  False  False   True

In [9]:
df.isnull().sum()

Names    1
Ages     1
City     1
dtype: int64

$Method-1$:
    
**Fill with a Random value**

In [12]:
df.fillna(40,inplace=True)

# inplace=True

In [13]:
df

    Names  Ages  City
0     Ram  40.0   Hyd
1  Laxman  23.0   Blr
2      40  22.0  Pune
3    Sita  21.0    40

In [ ]:
# Run the first cell again

In [15]:
df

    Names  Ages  City
0     Ram   NaN   Hyd
1  Laxman  23.0   Blr
2     NaN  22.0  Pune
3    Sita  21.0   NaN

$Method-2$

**select a particular column and fill with Random number**

In [16]:
import numpy as np
import pandas as pd


data={"Names":['Ram','Laxman',np.nan,'Sita'],
     "Ages":[np.nan,23,22,21],
     "City":["Hyd",'Blr','Pune',np.nan]}

df=pd.DataFrame(data)

In [20]:
df.dtypes

Names     object
Ages     float64
City      object
dtype: object

In [23]:
df['Ages'].fillna(20,inplace=True)

In [25]:
df['Names'].fillna('Krishna',inplace=True)
df['City'].fillna('Chennai',inplace=True)

In [26]:
df

     Names  Ages     City
0      Ram  20.0      Hyd
1   Laxman  23.0      Blr
2  Krishna  22.0     Pune
3     Sita  21.0  Chennai

$Method-3$

**Pad**

In [27]:
import numpy as np
import pandas as pd


data={"Names":['Ram','Laxman',np.nan,'Sita'],
     "Ages":[np.nan,23,22,21],
     "City":["Hyd",'Blr','Pune',np.nan]}

df=pd.DataFrame(data)

In [28]:
df

    Names  Ages  City
0     Ram   NaN   Hyd
1  Laxman  23.0   Blr
2     NaN  22.0  Pune
3    Sita  21.0   NaN

In [29]:
df.fillna(method='pad')

    Names  Ages  City
0     Ram   NaN   Hyd
1  Laxman  23.0   Blr
2  Laxman  22.0  Pune
3    Sita  21.0  Pune

In [30]:
df.fillna(method='bfill')

    Names  Ages  City
0     Ram  23.0   Hyd
1  Laxman  23.0   Blr
2    Sita  22.0  Pune
3    Sita  21.0   NaN

In [31]:
df.fillna(method='backfill')

    Names  Ages  City
0     Ram  23.0   Hyd
1  Laxman  23.0   Blr
2    Sita  22.0  Pune
3    Sita  21.0   NaN

In [32]:
df.fillna(method='ffill')

    Names  Ages  City
0     Ram   NaN   Hyd
1  Laxman  23.0   Blr
2  Laxman  22.0  Pune
3    Sita  21.0  Pune

In [33]:
df

    Names  Ages  City
0     Ram   NaN   Hyd
1  Laxman  23.0   Blr
2     NaN  22.0  Pune
3    Sita  21.0   NaN

$Method-4$:
    
**Fill the missing values using axis**

In [39]:
import numpy as np
import pandas as pd


data={"Names":['Ram','Laxman',np.nan,'Sita'],
     "Ages":[np.nan,23,22,21],
     "City":["Hyd",'Blr','Pune',np.nan]}

df=pd.DataFrame(data)
df

    Names  Ages  City
0     Ram   NaN   Hyd
1  Laxman  23.0   Blr
2     NaN  22.0  Pune
3    Sita  21.0   NaN

In [38]:
df.fillna(method='pad', axis=1)

    Names  Ages  City
0     Ram   Ram   Hyd
1  Laxman  23.0   Blr
2     NaN  22.0  Pune
3    Sita  21.0  21.0

$Method-5$

- Random

- pad

- bfill

- mean-median-mode

In [40]:
import numpy as np
import pandas as pd


data={"Names":['Ram','Laxman',np.nan,'Sita'],
     "Ages":[np.nan,23,22,21],
     "City":["Hyd",'Blr','Pune',np.nan]}

df=pd.DataFrame(data)

In [41]:
mean_age=df['Ages'].mean()
mean_age

22.0

In [42]:
df['Ages'].fillna(mean_age)

0    22.0
1    23.0
2    22.0
3    21.0
Name: Ages, dtype: float64

In [43]:
# If outlier are there fill with median values
median_age=df['Ages'].median()
median_age

22.0

In [44]:
df['Ages'].fillna(median_age)

0    22.0
1    23.0
2    22.0
3    21.0
Name: Ages, dtype: float64